Repository: shuzhzh/TreeletHub
Catalog: TreeletHub_Mac/Localizable.xcstrings
Source language: en
Languages: zh_hans

# mac.server.err.bad_swap
source: Cannot swap those slots
zh_hans: 无效的交换参数

# mac.server.err.bad_target
source: Unsupported control target
zh_hans: 无效的控制目标

# mac.server.err.disconnect
source: The Mac ended this session
zh_hans: Mac 已结束此会话

# mac.server.err.missing_pin
source: Pairing code missing
zh_hans: 缺少 PIN

# mac.server.err.no_app
source: No app is assigned to that slot
zh_hans: 该格未配置应用

# mac.server.err.not_paired
source: Not paired
zh_hans: 未配对

# mac.server.err.not_shortcut
source: That slot is not a shortcut
zh_hans: 该格不是快捷操作

# mac.server.listening
source: Listening on the network for paired phones
zh_hans: 正在网络上等待已配对的手机连接

# mac.settings.language
source: Language
zh_hans: 多语言设置

# mac.settings.menu_a11y
source: TreeletHub settings
zh_hans: TreeletHub 设置

# mac.settings.title
source: Settings
zh_hans: 设置

# mac.shortcut.brightness
source: Brightness
zh_hans: 屏幕亮度

# mac.shortcut.copy
source: Copy
zh_hans: 复制

# mac.shortcut.media
source: Media controls
zh_hans: 媒体控制

# mac.shortcut.open_url
source: Open link
zh_hans: 打开网址

# mac.shortcut.open_url_named
source: Open link %@
zh_hans: 打开网址 %@

# mac.shortcut.paste
source: Paste
zh_hans: 粘贴

# mac.shortcut.picker_hint
source: This picker supports volume, screenshots, and opening URLs. Other shortcut types are not available here.
zh_hans: 此处支持音量、截图与打开网址；其他快捷方式类型不可用。

# mac.shortcut.picker_title
source: Choose a shortcut
zh_hans: 选择快捷操作

# mac.shortcut.screenshot_full
source: Screenshot — full screen
zh_hans: 一键截图（全屏）

# mac.shortcut.screenshot_region
source: Screenshot — selection
zh_hans: 一键截图（区域）

# mac.shortcut.select_all
source: Select all
zh_hans: 全选

# mac.shortcut.unsupported_message
source: This build does not ship brightness, media-transport, or editing shortcuts (select all / copy / paste) in the picker.
zh_hans: 本构建未在选取器中提供亮度、媒体控制及编辑类（全选/复制/粘贴）快捷方式。

# mac.shortcut.url_field
source: Full URL (for example https://www.apple.com)
zh_hans: 完整网址（例如 https://www.apple.com）

# mac.shortcut.volume
source: Volume
zh_hans: 音量大小

# mac.slot.add
source: Add
zh_hans: 添加

# mac.slot.app
source: App
zh_hans: 应用

# mac.slot.clear
source: Clear slot
zh_hans: 清除

# mac.slot.help_drag
source: Drag a filled tile onto another to swap, or onto an empty slot to move it.
zh_hans: 将已配置格子拖到另一格可交换；拖到空格可移动。

# mac.subscription.auto_renew_legal
source: This is a one-time In-App Purchase, not a subscription. Links open in your browser.
zh_hans: 这是一次性内购，不是订阅。链接将在浏览器中打开。

# mac.subscription.benefit_aipad_p1
source: Drop ChatGPT, Codex, or Cursor into the hub and one tap on iPhone turns the phone into a dedicated controller for that agent — the whole vibe-coding loop, from launching a run to steering what it does next, moves into your hand instead of staying on the keyboard and trackpad.
zh_hans: 把 ChatGPT、Codex、Cursor 放进九宫格，在 iPhone 上一点，手机就成为这个 agent 的专属控制器——从发起运行到引导它的下一步，整个 vibe coding 循环握在手里，而不是黏在键盘和触控板上。

# mac.subscription.benefit_aipad_p2
source: Approve or redirect what the agent proposes, dial its reasoning up or down, and dictate prompts by voice — transcribed on the iPhone, dropped into the Mac composer, sent with a tap — so you can keep an agent moving from the couch, the kitchen, or two meters from the screen.
zh_hans: 批准或纠偏 agent 的提议、上下调节它的推理强度、按住用语音口述提示词——在 iPhone 本机识别成文字、落进 Mac 输入框、一点发送——躺沙发、进厨房、离屏幕两米，都能让 agent 持续推进。

# mac.subscription.benefit_aipad_p3
source: Every client ships a layout tuned to its own workflow and every control is remappable. Combine it with multi-page hubs to run AI coding, writing, and everyday apps from a single remote.
zh_hans: 每个客户端都有贴合自身工作流的默认布局，且每个控件都可自定义映射；配合多页九宫格，用一套遥控器统筹 AI 编程、写作与日常应用。

# mac.subscription.benefit_aipad_title
source: AI control keyboard for vibe coding
zh_hans: AI 控制键盘 · 掌上 vibe coding

# mac.subscription.benefit_grid_p1
source: Free includes %lld apps. Pro removes the limit.
zh_hans: 免费可添加 %lld 个；Pro 不限数量。

# mac.subscription.benefit_grid_title
source: Unlimited apps
zh_hans: 无限添加应用

# mac.subscription.benefit_island_p1
source: Floating desktop control bar with media, weather, and clipboard.
zh_hans: 桌面悬浮控制条：媒体、天气与剪贴板。

# mac.subscription.benefit_island_p2
source: Includes media shortcuts, clock, location-aware weather (Apple Weather / WeatherKit), clipboard history, staging, AirDrop hand-off, and the same hub grid you see on iPhone.
zh_hans: 包含媒体快捷、时钟、基于定位的天气（Apple Weather / WeatherKit）、剪贴板历史、暂存与隔空投送接力，以及与 iPhone 同步的九宫格等。

# mac.subscription.benefit_island_title
source: Dynamic Island
zh_hans: 灵动岛

# mac.subscription.benefit_keyboardhud_p1
source: Hold Control to launch apps from a floating keymap.
zh_hans: 按住 Control，用浮动键位快速启动应用。

# mac.subscription.benefit_keyboardhud_p2
source: Apps are auto-assigned by first letter on first use. Drag to swap keys, click to add or replace, and build a muscle-memory launcher that feels faster than the Dock.
zh_hans: 首次开启会按应用名称首字母自动填充键位；支持拖拽交换、点击添加或替换，打造比程序坞更顺手的肌肉记忆启动方式。

# mac.subscription.benefit_keyboardhud_p3
source: Perfect for power users who live on the keyboard: fewer mouse trips, fewer context switches, and one Control press away from any app you care about.
zh_hans: 为键盘党而生：减少鼠标往返与上下文切换，常用应用只需一次 Control，即可随时到位。

# mac.subscription.benefit_keyboardhud_title
source: Keyboard launcher
zh_hans: 键盘启动器

# mac.subscription.benefit_sync_p1
source: Keep hub layout and Pro status in sync on iPhone and Android.
zh_hans: 布局与 Pro 状态同步到配对的 iPhone 与 Android。

# mac.subscription.benefit_sync_title
source: Phone sync
zh_hans: 手机同步

# mac.subscription.buy_now_price
source: Unlock — %@
zh_hans: 解锁 — %@

# mac.subscription.err.no_products
source: StoreKit cannot load this product yet. Submit the Pro IAP with your next app version in App Store Connect, then tap Refresh.
zh_hans: 商店暂时拉不到该商品。请在 App Store Connect 把 Pro 内购随下一版 App 提交审核，然后点「刷新」。

# mac.subscription.err.pending
source: Purchase submitted—waiting for Apple to confirm.
zh_hans: 订阅请求已提交，等待系统确认。

# mac.subscription.err.unknown
source: Unexpected purchase state. Try again later.
zh_hans: 未知购买状态，请稍后重试。

# mac.subscription.err.verify_failed
source: We could not verify the subscription. Try again.
zh_hans: 订阅校验失败，请重试。

# mac.subscription.eula
source: Terms of use (EULA)
zh_hans: 使用条款（EULA）

# mac.subscription.expires
source: Renews or expires: %@
zh_hans: 到期时间：%@

# mac.subscription.expires_unknown
source: Subscription is active. Tap Refresh if the renewal date is missing.
zh_hans: 订阅已生效。若未显示到期时间，请点击「刷新」同步 App Store。

# mac.subscription.fetching
source: Contacting the App Store…
zh_hans: 正在从 App Store 拉取订阅信息…

# mac.subscription.includes_desc
source: Pay once. Unlock everything below forever.
zh_hans: 一次买断，永久解锁以下全部功能。

# mac.subscription.includes_title
source: Included while subscribed
zh_hans: 本期订阅有效期内包含

# mac.subscription.loading
source: Loading subscription information…
zh_hans: 正在从 App Store 拉取订阅信息…

# mac.subscription.not_subscribed
source: Locked
zh_hans: 未解锁

# mac.subscription.once_badge
source: One-time purchase
zh_hans: 一次性买断

# mac.subscription.price_loading
source: Fetching price…
zh_hans: 价格加载中…

# mac.subscription.privacy
source: Privacy policy
zh_hans: 隐私政策

# mac.subscription.refresh
source: Refresh
zh_hans: 刷新

# mac.subscription.renewal
source: One-time purchase. No subscription. No auto-renewal.
zh_hans: 一次性买断。无订阅，不自动续费。

# mac.subscription.restore
source: Restore purchases
zh_hans: 恢复购买

# mac.subscription.store_desc
source: App Store description
zh_hans: App Store 商品说明

# mac.subscription.subscribe_now
source: Unlock Pro
zh_hans: 解锁 Pro

# mac.subscription.subscribed
source: Unlocked
zh_hans: 已解锁

# mac.subscription.title
source: Unlock Pro
zh_hans: 解锁 Pro

# mac.toolbar.subscription
source: Subscription
zh_hans: 订阅管理

# mac.typingsound.bullet1
source: Choose a typing sound preset. Selecting a sound plays a preview immediately.
zh_hans: 从下拉菜单选择打字音效，默认无音效；选中后会立即播放预览。

# mac.typingsound.bullet2
source: System-wide typing sounds require Accessibility and Input Monitoring permissions.
zh_hans: 在其他 App 中生效需要辅助功能与输入监控权限。

# mac.typingsound.permission.message
source: TreeletHub needs Accessibility and Input Monitoring access to detect keystrokes and play typing sounds system-wide.
zh_hans: TreeletHub 需要辅助功能与输入监控权限，才能在全局检测按键并播放打字音效。

# mac.typingsound.permission.title
source: Permissions required for typing sounds
zh_hans: 打字音效需要系统权限

# mac.typingsound.preset.crisp
source: Crisp
zh_hans: 清脆

# mac.typingsound.preset.mechanicalBlue
source: Mechanical Blue
zh_hans: 机械青轴

# mac.typingsound.preset.mechanicalBrown
source: Mechanical Brown
zh_hans: 机械茶轴

# mac.typingsound.preset.mechanicalRed
source: Mechanical Red
zh_hans: 机械红轴

# mac.typingsound.preset.none
source: None
zh_hans: 无音效

# mac.typingsound.preset.soft
source: Soft
zh_hans: 轻柔

# mac.typingsound.preset.systemClassic
source: System Classic
zh_hans: 系统经典

# mac.typingsound.preset.typewriter
source: Typewriter
zh_hans: 打字机

# mac.typingsound.title
source: Typing Sounds
zh_hans: 打字音效

# mac.weather.err.needs_location
source: Turn on location access to load local weather.
zh_hans: 需要定位权限才能获取当地天气。

source: Weather
zh_hans: 天气
